app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "articles"
SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" DESC LIMIT 5
---
  def index
    @articles = Article.all.paginate(page: params[:page], per_page: 2).reverse_order
    @last5 = Article.last(5)

SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" DESC LIMIT 5
---
  def show
    @last5 = Article.last(5)

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["body", "A test article\r\n"], ["created_at", "2017-02-04 20:58:14.507220"], ["updated_at", "2017-02-04 20:58:14.507220"]]
---
  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "A test article: and edited\r\n"], ["updated_at", "2017-02-04 20:58:25.250199"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)