app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", ";lk;lk;lk"], ["article_id", 1], ["created_at", "2017-02-06 21:09:48.000768"], ["updated_at", "2017-02-06 21:09:48.000768"]]
UPDATE "comments" SET "user_id" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["user_id", 1], ["updated_at", "2017-02-06 21:09:48.021408"], ["id", 1]]
---
	def create
		@article = Article.find(params[:article_id])
		@comment = Article.comments.create(params[:comments].permit(:comment))
		@comment.user_id = current_user.id if current_user

		if @comment.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["article_id", 2], ["id", 6]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "pppp111111"], ["updated_at", "2017-02-06 21:33:43.979016"], ["id", 6]]
---
	def update
		@article = Article.find(params[:article_id])
		@comment = @article.comments.find(params[:id])

		if @comment.update(params[:comment.permit(:body)])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["article_id", 2], ["id", 6]]
---
	def edit
		@article = Article.find(params[:article_id])
		@comment = @article.comments.find(params[:id])