app/controllers/pages_controller.rb

	  def home
	  	@articles = Article.last(5)
---
SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" DESC LIMIT 5